In [1]:
import pandas as pd
import numpy as np

In [5]:
dict_data = {"one": np.arange(4), 
        "two": ['hello', 'hi', 'chiao', 'chuss'],
       "three": [3.4, 1.2, 4.6, 6.7]}
dict_data

{'one': array([0, 1, 2, 3]),
 'two': ['hello', 'hi', 'chiao', 'chuss'],
 'three': [3.4, 1.2, 4.6, 6.7]}

In [15]:
data = pd.DataFrame(dict_data, index = ['Du', 'En', 'It', 'Ge'])
data

    one    two  three
Du    0  hello    3.4
En    1     hi    1.2
It    2  chiao    4.6
Ge    3  chuss    6.7

In [10]:
data['one']

D    0
E    1
I    2
G    3
Name: one, dtype: int64

In [23]:
data.loc[data['three'] > 4]['two']

It    chiao
Ge    chuss
Name: two, dtype: object

In [27]:
np.arange(9).reshape(3,3)

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [70]:
data2 = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index = ['Ohio', 'Colorado', 'Utah', 'Texas'],
                    columns = ['one', 'two', 'three', 'four'])
data2

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
Texas      12   13     14    15

In [54]:
data2.loc["Colorado", ['one', 'two']]

one    4
two    5
Name: Colorado, dtype: int64

In [64]:
data2.loc['Ohio': 'Utah', ['two', 'two', 'four']]

          two  two  four
Ohio        1    1     3
Colorado    5    5     7
Utah        9    9    11

In [75]:
data2.iloc[:, :3][data2.one > 5]

       one  two  three
Utah     8    9     10
Texas   12   13     14

In [76]:
data2.one > 5

Ohio        False
Colorado    False
Utah         True
Texas        True
Name: one, dtype: bool

In [90]:
newcols = data2.columns.append(pd.Index(['five']))
data2.reindex(columns = newcols, fill_value = 12)

          one  two  three  four  five
Ohio        0    1      2     3    12
Colorado    4    5      6     7    12
Utah        8    9     10    11    12
Texas      12   13     14    15    12

In [93]:
data2.insert(2, 'six', [17, 19, 21, 23])
data2

          one  two  six  three  four
Ohio        0    1   17      2     3
Colorado    4    5   19      6     7
Utah        8    9   21     10    11
Texas      12   13   23     14    15